import React from "react";
import Header from "../ui/Header";

function Aboutus() {
  return (
    <>
     <Header/>
    <div>
      {" "}
      <div className="relative ">
        <img   src="/public/photo/درباره ترخینه.png" alt="" />
        <span className="absolute  top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 font-bold text-4xl whitespace-nowrap text-white">
          درباره ترخینه بیشتر بدانید!
        </span>
      </div>
      <div className="flex flex-col mb-3 mt-8">
        <div className="font-bold text-2xl text-Gray-8 mb-4">درباره ما</div>
        <div className="flex w-full">
          <div className="w-1/2  text-xl leading-9 text-Gray-7">
            رستوران‌های زنجیره‌ای ترخینه در سال ۱۳۶۸ افتتاح گردیده‌اند و در طی
            این سال‌ها همواره با ارائه غذاهای باکیفیت و سرویس سریع و به موقع در
            تلاش برای جلب رضایت مشتریان خود بوده‌اند. در طی این سال‌ها اولیت جلب
            رضایت مشتریان بوده است. دراین خصوص ترخینه همیشه در تلاش بوده تا در
            طی این زمان‌ها کیفیت غذاهای خودرا در بهترین حالت نگه داشته و حتی با
            نوسانات قیمت‌های مواد اولیه در بازار قیمت خود را ثابت نگه داشته است.
            ترخینه شعبات خود را افتتاح کرده که بسیار شیک و مدرن می‌باشند و برای
            برگزاری جشن‌های کوچک و بزرگ شما مشتریان عزیز توانایی پذیرایی با
            کیفیت بالا را دارند. سالن پذیرایی شعبات در دو طبقه مجزا به همراه راه
            پله مدرن و آسانسور برای افراد کم‌توان و سالخورده آماده ارائه سرویس
            به شما عزیزان می‌باشند. چشم انداز: در آینده‌ای نزدیک تالار پذیرایی
            شعبات راه اندازی شده و آماده برگزاری جشن‌ها و مراسم‌های بزرگ شما
            خواهند بود . به امید آن روز که همه ایرانیان سالم و سلامت باشند.
          </div>
          <div >
            <img src="/public/photo/aboutus2.png" alt="" className=" object-contain"/>
          </div>
        </div>
      </div>
      <div className="flex items-center justify-between mx-10">
        <div className="border-l-4 mb-6 h-28 mt-10 relative flex flex-col items-center ">
        
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="184"
            height="136"

            fill="none"
          >
            <path
              fill="#353535"
              d="M92 69.5c-6.34 0-11.5-5.16-11.5-11.5S85.66 46.5 92 46.5s11.5 5.16 11.5 11.5S98.34 69.5 92 69.5Zm0-20c-4.68 0-8.5 3.82-8.5 8.5s3.82 8.5 8.5 8.5 8.5-3.82 8.5-8.5-3.82-8.5-8.5-8.5ZM109.18 89.5c-.82 0-1.5-.68-1.5-1.5 0-6.9-7.04-12.5-15.68-12.5S76.32 81.1 76.32 88c0 .82-.68 1.5-1.5 1.5s-1.5-.68-1.5-1.5c0-8.54 8.38-15.5 18.68-15.5 10.3 0 18.68 6.96 18.68 15.5 0 .82-.68 1.5-1.5 1.5Z"
            />
          </svg>

        </div>
        <div className="border-l-4 mb-6 h-28 mt-10 flex items-center justify-center w-1/4">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="48"
            height="48"
            fill="none"

          >
            <path
              fill="#353535"
              d="M44 45.5H10c-4.14 0-7.5-3.36-7.5-7.5V4c0-.82.68-1.5 1.5-1.5s1.5.68 1.5 1.5v34c0 2.48 2.02 4.5 4.5 4.5h34c.82 0 1.5.68 1.5 1.5s-.68 1.5-1.5 1.5Z"
            />
            <path
              fill="#353535"
              d="M10 35.5c-.34 0-.7-.12-.98-.36-.62-.54-.7-1.48-.16-2.12l9.18-10.72c1-1.16 2.44-1.86 3.96-1.92 1.52-.04 3.02.52 4.1 1.6l1.9 1.9c.5.5 1.14.74 1.86.74.7-.02 1.34-.34 1.8-.88l9.18-10.72c.54-.62 1.48-.7 2.12-.16.62.54.7 1.48.16 2.12L33.94 25.7c-1 1.16-2.44 1.86-3.96 1.92-1.54.04-3.02-.52-4.1-1.6L24 24.12c-.5-.5-1.16-.76-1.86-.74-.7.02-1.34.34-1.8.88l-9.18 10.72c-.32.34-.74.52-1.16.52Z"
            />
          </svg>
        </div>
        <div className="border-l-4 mb-6 h-28 mt-10 flex items-center justify-center w-1/4">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="48"
            height="48"
            fill="none"
          >
            <path
              fill="#353535"
              d="M35.2 45.12H12.8c-3.64 0-6.96-2.8-7.56-6.4L2.58 22.8c-.42-2.48.78-5.66 2.76-7.24L19.2 4.46c2.68-2.16 6.9-2.14 9.6.02l13.86 11.08c1.96 1.58 3.16 4.76 2.76 7.24l-2.66 15.92c-.6 3.54-3.98 6.4-7.56 6.4ZM23.98 5.88c-1.06 0-2.12.32-2.9.94L7.22 17.92c-1.14.92-1.92 2.96-1.68 4.4L8.2 38.24c.36 2.1 2.46 3.88 4.6 3.88h22.4c2.14 0 4.24-1.78 4.6-3.9l2.66-15.92c.24-1.44-.56-3.5-1.68-4.4L26.92 6.82c-.8-.62-1.86-.94-2.94-.94Z"
            />
            <path
              fill="#353535"
              d="M28.24 30.26c-.38 0-.74-.14-1.04-.42-1.94-1.86-4.46-1.86-6.42 0-.6.58-1.54.56-2.12-.04-.58-.6-.56-1.54.04-2.12 3.1-2.98 7.44-2.98 10.56 0 .6.58.62 1.52.04 2.12-.26.3-.66.46-1.06.46Z"
            />
            <path
              fill="#353535"
              d="M32.48 26.02c-.38 0-.76-.14-1.04-.42-.94-.92-2-1.66-3.12-2.2-2.8-1.34-5.86-1.34-8.64 0-1.12.54-2.16 1.28-3.12 2.2-.58.58-1.54.58-2.12-.02-.58-.6-.56-1.54.02-2.12 1.18-1.16 2.5-2.08 3.92-2.76 3.62-1.74 7.62-1.74 11.22 0 1.42.68 2.74 1.6 3.92 2.76a1.491 1.491 0 0 1-1.04 2.56ZM24 35c-.52 0-1.02-.2-1.42-.58-.78-.78-.78-2.04 0-2.82.78-.78 2.06-.78 2.84 0 .78.78.78 2.04 0 2.82-.4.38-.9.58-1.42.58Z"
            />
          </svg>
        </div>
        <div className="border-l-4 mb-6 h-28 mt-10 flex items-center justify-center w-1/4">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="48"
            height="48"
            fill="none"
          >
            <path
              fill="#353535"
              d="M32.76 45.5H6.48c-1.9 0-3.66-.88-4.8-2.42a5.955 5.955 0 0 1-.92-5.38l8.42-27.06A5.964 5.964 0 0 1 14.9 6.4h24.6c2.42 0 4.6 1.44 5.52 3.68.5 1.16.6 2.48.3 3.78l-6.74 27.06a5.953 5.953 0 0 1-5.82 4.58ZM14.92 9.42a3 3 0 0 0-2.86 2.12L3.64 38.6c-.28.94-.12 1.92.48 2.72.56.76 1.44 1.2 2.38 1.2h26.28c1.38 0 2.58-.94 2.9-2.28l6.74-27.08c.16-.66.12-1.32-.14-1.9-.48-1.14-1.54-1.86-2.76-1.86h-24.6v.02Z"
            />
            <path
              fill="#353535"
              d="M41.56 45.5H32c-.82 0-1.5-.68-1.5-1.5s.68-1.5 1.5-1.5h9.56c.82 0 1.58-.34 2.14-.94.56-.6.84-1.4.78-2.22L42.5 12.1c-.06-.82.56-1.54 1.38-1.6.82-.04 1.54.56 1.6 1.38l1.98 27.24c.12 1.64-.46 3.28-1.58 4.48a5.815 5.815 0 0 1-4.32 1.9ZM19.36 14.26c-.12 0-.24-.02-.36-.04-.8-.2-1.3-1-1.1-1.82l2.08-8.64c.2-.8 1-1.3 1.82-1.1.8.2 1.3 1 1.1 1.82l-2.08 8.64c-.16.68-.78 1.14-1.46 1.14ZM32.76 14.28c-.1 0-.22 0-.32-.04a1.53 1.53 0 0 1-1.16-1.78l1.88-8.68c.18-.82.98-1.32 1.78-1.16.8.16 1.32.98 1.16 1.78l-1.88 8.68c-.14.72-.76 1.2-1.46 1.2ZM31.4 25.5h-16c-.82 0-1.5-.68-1.5-1.5s.68-1.5 1.5-1.5h16c.82 0 1.5.68 1.5 1.5s-.68 1.5-1.5 1.5ZM29.4 33.5h-16c-.82 0-1.5-.68-1.5-1.5s.68-1.5 1.5-1.5h16c.82 0 1.5.68 1.5 1.5s-.68 1.5-1.5 1.5Z"
            />
          </svg>
        </div>
      </div>
    </div></>
  );
}

export default Aboutus;
