
function Knoe() {
  return (
          <div className="flex items-center justify-between  border  mt-3 rounded-lg gap-5 bg-Gray-3   py-5 ">
            <div className="flex items-center mr-6">
              <svg
              className="flex-0"
                xmlns="http://www.w3.org/2000/svg"
                width="35"
                height="25"
                fill="none"
              >
                <path
                  fill="#353535"
                  d="M12 14.25c-.41 0-.75-.34-.75-.75V8.25c0-.41.34-.75.75-.75s.75.34.75.75v5.25c0 .41-.34.75-.75.75ZM12 17.75a.99.99 0 0 1-.71-.29c-.09-.1-.16-.21-.22-.33a.986.986 0 0 1-.07-.38c0-.26.11-.52.29-.71.37-.37 1.05-.37 1.42 0 .18.19.29.45.29.71 0 .13-.03.26-.08.38s-.12.23-.21.33a.99.99 0 0 1-.71.29Z"
                />
                <path
                  fill="#353535"
                  d="M12 23.25c-.67 0-1.35-.17-1.95-.52L4.11 19.3c-1.2-.7-1.95-1.99-1.95-3.38V9.08c0-1.39.75-2.68 1.95-3.38l5.94-3.43c1.2-.7 2.69-.7 3.9 0l5.94 3.43c1.2.7 1.95 1.99 1.95 3.38v6.84c0 1.39-.75 2.68-1.95 3.38l-5.94 3.43c-.6.35-1.28.52-1.95.52Zm0-20c-.41 0-.83.11-1.2.32L4.86 7c-.74.43-1.2 1.22-1.2 2.08v6.84c0 .85.46 1.65 1.2 2.08l5.94 3.43c.74.43 1.66.43 2.39 0L19.13 18c.74-.43 1.2-1.22 1.2-2.08V9.08c0-.85-.46-1.65-1.2-2.08l-5.94-3.43c-.36-.21-.78-.32-1.19-.32Z"
                />
              </svg>
              <div className="pr-4  text-nowrap">قابل توجه</div>
            </div>
            <div className="text-[10px] mt-3 text-Gray-7 ">هزینه سفارش شما در حین تحویل کالا دریافت خواهد شد. لطفا قبل از تحویل کالا کارت بانکی یا پول نقد همراه خود داشته باشید و از درخواست برای پرداخت در زمان بعدی یا نسیه خودداری فرمایید. با تشکر از همراهی شما.</div>
          </div>
  )
}

export default Knoe